--------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  A:\Lehre\2015_WS_Workshop Kausalanalyse Kassel\Uebung_Matching\matching_DID.log
  log type:  text
 opened on:  28 Oct 2015, 16:10:06

. 
. 
. *******************************************
. * global defining control variables + deleting missings
. *******************************************
. # d ;
delimiter now ;
. global X "age female east nongerman casmin1c casmin2a casmin2bc casmin3ab expft expue01 firm20_199 firm200_1999 firm1999over publicservice";

. # d cr
delimiter now cr
. 
. **** delete missings
. egen varmiss=rowmiss(D $X)

. drop if varmiss>0
(848 observations deleted)

. 
. 
. ****************************** Selection on observables: Propensity score matching **********************************
. 
. *******************************************
. * Ex 1.1) NN(1) matching with replacement
. *******************************************
. psmatch2 D $X, outcome(Y03) logit common neighbor(1) ate 

Logistic regression                               Number of obs   =       3266
                                                  LR chi2(14)     =      64.80
                                                  Prob > chi2     =     0.0000
Log likelihood =   -350.701                       Pseudo R2       =     0.0846

-------------------------------------------------------------------------------
            D |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
          age |  -.0356716   .0244657    -1.46   0.145    -.0836235    .0122804
       female |   .0954899   .2518003     0.38   0.705    -.3980296    .5890094
         east |   .3632222   .2610973     1.39   0.164    -.1485192    .8749635
    nongerman |  -.7378988   .5828336    -1.27   0.205    -1.880232    .4044341
     casmin1c |   -.282231   .5533207    -0.51   0.610     -1.36672    .8022576
     casmin2a |   .2179218   .5403214     0.40   0.687    -.8410887    1.276932
    casmin2bc |   -.174441    .622478    -0.28   0.779    -1.394475    1.045593
    casmin3ab |  -.0481858   .5770645    -0.08   0.933    -1.179211     1.08284
        expft |  -.0048655   .0233796    -0.21   0.835    -.0506886    .0409577
      expue01 |   .2927043   .0707807     4.14   0.000     .1539767    .4314319
   firm20_199 |   .2910684   .2571773     1.13   0.258    -.2129899    .7951267
 firm200_1999 |  -.7956691   .3918182    -2.03   0.042    -1.563619   -.0277196
 firm1999over |  -1.129742   .4600999    -2.46   0.014    -2.031521    -.227963
publicservice |   -.809855   .3730135    -2.17   0.030    -1.540948   -.0787619
        _cons |  -2.131326   .8886311    -2.40   0.016    -3.873011   -.3896412
-------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
             Y03  Unmatched |  2.2346316   2.58840511  -.353773517    .05156966    -6.86
                        ATT |  2.2346316   2.33886884  -.104237243   .084434241    -1.23
                        ATU | 2.57729645   2.28262979  -.294666661            .        .
                        ATE |                          -.289596787            .        .
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |       186      2,998 |     3,184 
   Treated |         0         82 |        82 
-----------+----------------------+----------
     Total |       186      3,080 |     3,266 


. pstest $X, both

----------------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test    |  V(T)/
Variable          Matched | Treated Control    %bias  |bias| |    t    p>|t| |  V(C)
--------------------------+----------------------------------+---------------+----------
age                    U  | 37.646   40.031    -29.8         |  -2.73  0.006 |  1.10
                       M  | 37.646   38.512    -10.8    63.7 |  -0.68  0.497 |  1.02
                          |                                  |               |
female                 U  | .45122   .40861      8.6         |   0.77  0.439 |     .
                       M  | .45122   .46341     -2.5    71.4 |  -0.16  0.876 |     .
                          |                                  |               |
east                   U  | .36585   .23524     28.7         |   2.74  0.006 |     .
                       M  | .36585   .45122    -18.7    34.6 |  -1.11  0.269 |     .
                          |                                  |               |
nongerman              U  | .04878   .07915    -12.4         |  -1.01  0.313 |     .
                       M  | .04878   .04878      0.0   100.0 |   0.00  1.000 |     .
                          |                                  |               |
casmin1c               U  | .18293   .26036    -18.7         |  -1.58  0.114 |     .
                       M  | .18293   .14634      8.8    52.8 |   0.63  0.531 |     .
                          |                                  |               |
casmin2a               U  | .46341   .32852     27.8         |   2.56  0.010 |     .
                       M  | .46341       .5     -7.5    72.9 |  -0.47  0.642 |     .
                          |                                  |               |
casmin2bc              U  | .09756   .10992     -4.0         |  -0.35  0.724 |     .
                       M  | .09756    .0122     27.9  -590.5 |   2.43  0.016 |     .
                          |                                  |               |
casmin3ab              U  | .19512   .23964    -10.8         |  -0.93  0.351 |     .
                       M  | .19512    .2439    -11.8    -9.6 |  -0.75  0.454 |     .
                          |                                  |               |
expft                  U  | 12.722   15.261    -27.6         |  -2.51  0.012 |  1.08
                       M  | 12.722   13.838    -12.1    56.1 |  -0.79  0.430 |  1.18
                          |                                  |               |
expue01                U  | .87561   .32648     49.2         |   5.30  0.000 |  1.97*
                       M  | .87561   .59146     25.5    48.3 |   1.44  0.153 |  1.06
                          |                                  |               |
firm20_199             U  | .43902   .26947     35.9         |   3.40  0.001 |     .
                       M  | .43902   .43902      0.0   100.0 |   0.00  1.000 |     .
                          |                                  |               |
firm200_1999           U  | .10976   .23398    -33.3         |  -2.64  0.008 |     .
                       M  | .10976   .07317      9.8    70.5 |   0.81  0.420 |     .
                          |                                  |               |
firm1999over           U  | .07317    .2255    -43.7         |  -3.28  0.001 |     .
                       M  | .07317   .04878      7.0    84.0 |   0.65  0.517 |     .
                          |                                  |               |
publicservice          U  | .10976   .26759    -41.1         |  -3.21  0.001 |     .
                       M  | .10976   .10976      0.0   100.0 |  -0.00  1.000 |     .
                          |                                  |               |
----------------------------------------------------------------------------------------
* if variance ratio outside [0.64; 1.55] for U and [0.64; 1.55] for M

-----------------------------------------------------------------------------------
 Sample    | Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B      R     %Var
-----------+-----------------------------------------------------------------------
 Unmatched | 0.087     66.90    0.000     26.5      28.2      97.7*   0.75     33
 Matched   | 0.057     13.04    0.523     10.2       9.3      55.9*   2.43*     0
-----------------------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]

. psgraph, bin(50)

. 
. 
. *******************************************
. * Ex 1.2) other matching algorithms
. *******************************************
. psmatch2 D $X, outcome(Y03) logit common neighbor(5) quietly 
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
             Y03  Unmatched |  2.2346316   2.58840511  -.353773517    .05156966    -6.86
                        ATT |  2.2346316   2.45404009  -.219408495   .051405977    -4.27
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |     3,184 |     3,184 
   Treated |        82 |        82 
-----------+-----------+----------
     Total |     3,266 |     3,266 


. pstest $X, both

----------------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test    |  V(T)/
Variable          Matched | Treated Control    %bias  |bias| |    t    p>|t| |  V(C)
--------------------------+----------------------------------+---------------+----------
age                    U  | 37.646   40.031    -29.8         |  -2.73  0.006 |  1.10
                       M  | 37.646   37.915     -3.4    88.7 |  -0.22  0.827 |  1.19
                          |                                  |               |
female                 U  | .45122   .40861      8.6         |   0.77  0.439 |     .
                       M  | .45122   .41463      7.4    14.1 |   0.47  0.639 |     .
                          |                                  |               |
east                   U  | .36585   .23524     28.7         |   2.74  0.006 |     .
                       M  | .36585   .36098      1.1    96.3 |   0.06  0.949 |     .
                          |                                  |               |
nongerman              U  | .04878   .07915    -12.4         |  -1.01  0.313 |     .
                       M  | .04878   .04146      3.0    75.9 |   0.22  0.823 |     .
                          |                                  |               |
casmin1c               U  | .18293   .26036    -18.7         |  -1.58  0.114 |     .
                       M  | .18293    .2122     -7.1    62.2 |  -0.47  0.640 |     .
                          |                                  |               |
casmin2a               U  | .46341   .32852     27.8         |   2.56  0.010 |     .
                       M  | .46341   .45854      1.0    96.4 |   0.06  0.950 |     .
                          |                                  |               |
casmin2bc              U  | .09756   .10992     -4.0         |  -0.35  0.724 |     .
                       M  | .09756   .06585     10.4  -156.5 |   0.74  0.462 |     .
                          |                                  |               |
casmin3ab              U  | .19512   .23964    -10.8         |  -0.93  0.351 |     .
                       M  | .19512   .20488     -2.4    78.1 |  -0.16  0.877 |     .
                          |                                  |               |
expft                  U  | 12.722   15.261    -27.6         |  -2.51  0.012 |  1.08
                       M  | 12.722   13.232     -5.5    79.9 |  -0.37  0.708 |  1.39
                          |                                  |               |
expue01                U  | .87561   .32648     49.2         |   5.30  0.000 |  1.97*
                       M  | .87561   .76463      9.9    79.8 |   0.49  0.628 |  0.63*
                          |                                  |               |
firm20_199             U  | .43902   .26947     35.9         |   3.40  0.001 |     .
                       M  | .43902    .4561     -3.6    89.9 |  -0.22  0.827 |     .
                          |                                  |               |
firm200_1999           U  | .10976   .23398    -33.3         |  -2.64  0.008 |     .
                       M  | .10976   .08537      6.5    80.4 |   0.52  0.601 |     .
                          |                                  |               |
firm1999over           U  | .07317    .2255    -43.7         |  -3.28  0.001 |     .
                       M  | .07317   .06829      1.4    96.8 |   0.12  0.904 |     .
                          |                                  |               |
publicservice          U  | .10976   .26759    -41.1         |  -3.21  0.001 |     .
                       M  | .10976   .09024      5.1    87.6 |   0.41  0.679 |     .
                          |                                  |               |
----------------------------------------------------------------------------------------
* if variance ratio outside [0.64; 1.55] for U and [0.64; 1.55] for M

-----------------------------------------------------------------------------------
 Sample    | Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B      R     %Var
-----------+-----------------------------------------------------------------------
 Unmatched | 0.087     66.90    0.000     26.5      28.2      97.7*   0.75     33
 Matched   | 0.007      1.60    1.000      4.8       4.3      19.7    1.24     33
-----------------------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]

. 
. psmatch2 D $X, outcome(Y03) logit common neighbor(10) quietly 
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
             Y03  Unmatched |  2.2346316   2.58840511  -.353773517    .05156966    -6.86
                        ATT |  2.2346316    2.4687611  -.234129499   .047137828    -4.97
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |     3,184 |     3,184 
   Treated |        82 |        82 
-----------+-----------+----------
     Total |     3,266 |     3,266 


. pstest $X, both

----------------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test    |  V(T)/
Variable          Matched | Treated Control    %bias  |bias| |    t    p>|t| |  V(C)
--------------------------+----------------------------------+---------------+----------
age                    U  | 37.646   40.031    -29.8         |  -2.73  0.006 |  1.10
                       M  | 37.646   37.276      4.6    84.5 |   0.30  0.762 |  1.20
                          |                                  |               |
female                 U  | .45122   .40861      8.6         |   0.77  0.439 |     .
                       M  | .45122   .43659      2.9    65.7 |   0.19  0.852 |     .
                          |                                  |               |
east                   U  | .36585   .23524     28.7         |   2.74  0.006 |     .
                       M  | .36585    .3439      4.8    83.2 |   0.29  0.771 |     .
                          |                                  |               |
nongerman              U  | .04878   .07915    -12.4         |  -1.01  0.313 |     .
                       M  | .04878   .03902      4.0    67.9 |   0.30  0.762 |     .
                          |                                  |               |
casmin1c               U  | .18293   .26036    -18.7         |  -1.58  0.114 |     .
                       M  | .18293   .17927      0.9    95.3 |   0.06  0.952 |     .
                          |                                  |               |
casmin2a               U  | .46341   .32852     27.8         |   2.56  0.010 |     .
                       M  | .46341   .46341      0.0   100.0 |   0.00  1.000 |     .
                          |                                  |               |
casmin2bc              U  | .09756   .10992     -4.0         |  -0.35  0.724 |     .
                       M  | .09756       .1     -0.8    80.3 |  -0.05  0.959 |     .
                          |                                  |               |
casmin3ab              U  | .19512   .23964    -10.8         |  -0.93  0.351 |     .
                       M  | .19512   .20244     -1.8    83.6 |  -0.12  0.907 |     .
                          |                                  |               |
expft                  U  | 12.722   15.261    -27.6         |  -2.51  0.012 |  1.08
                       M  | 12.722   12.743     -0.2    99.2 |  -0.02  0.988 |  1.41
                          |                                  |               |
expue01                U  | .87561   .32648     49.2         |   5.30  0.000 |  1.97*
                       M  | .87561   .72085     13.9    71.8 |   0.69  0.491 |  0.67
                          |                                  |               |
firm20_199             U  | .43902   .26947     35.9         |   3.40  0.001 |     .
                       M  | .43902   .43902      0.0   100.0 |   0.00  1.000 |     .
                          |                                  |               |
firm200_1999           U  | .10976   .23398    -33.3         |  -2.64  0.008 |     .
                       M  | .10976    .0939      4.3    87.2 |   0.33  0.739 |     .
                          |                                  |               |
firm1999over           U  | .07317    .2255    -43.7         |  -3.28  0.001 |     .
                       M  | .07317   .07073      0.7    98.4 |   0.06  0.952 |     .
                          |                                  |               |
publicservice          U  | .10976   .26759    -41.1         |  -3.21  0.001 |     .
                       M  | .10976   .09268      4.4    89.2 |   0.36  0.719 |     .
                          |                                  |               |
----------------------------------------------------------------------------------------
* if variance ratio outside [0.64; 1.55] for U and [0.64; 1.55] for M

-----------------------------------------------------------------------------------
 Sample    | Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B      R     %Var
-----------+-----------------------------------------------------------------------
 Unmatched | 0.087     66.90    0.000     26.5      28.2      97.7*   0.75     33
 Matched   | 0.005      1.14    1.000      3.1       2.4      16.6    1.02      0
-----------------------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]

. 
. psmatch2 D $X, outcome(Y03) logit common kernel(normal) quietly 
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
             Y03  Unmatched |  2.2346316   2.58840511  -.353773517    .05156966    -6.86
                        ATT |  2.2346316   2.33992082  -.105289224   .084568362    -1.25
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |     3,184 |     3,184 
   Treated |        82 |        82 
-----------+-----------+----------
     Total |     3,266 |     3,266 


. pstest $X, both

----------------------------------------------------------------------------------------
                Unmatched |       Mean               %reduct |     t-test    |  V(T)/
Variable          Matched | Treated Control    %bias  |bias| |    t    p>|t| |  V(C)
--------------------------+----------------------------------+---------------+----------
age                    U  | 37.646   40.031    -29.8         |  -2.73  0.006 |  1.10
                       M  | 37.646   38.622    -12.2    59.1 |  -0.76  0.447 |  0.99
                          |                                  |               |
female                 U  | .45122   .40861      8.6         |   0.77  0.439 |     .
                       M  | .45122   .46341     -2.5    71.4 |  -0.16  0.876 |     .
                          |                                  |               |
east                   U  | .36585   .23524     28.7         |   2.74  0.006 |     .
                       M  | .36585   .45122    -18.7    34.6 |  -1.11  0.269 |     .
                          |                                  |               |
nongerman              U  | .04878   .07915    -12.4         |  -1.01  0.313 |     .
                       M  | .04878   .04878      0.0   100.0 |   0.00  1.000 |     .
                          |                                  |               |
casmin1c               U  | .18293   .26036    -18.7         |  -1.58  0.114 |     .
                       M  | .18293   .15854      5.9    68.5 |   0.41  0.680 |     .
                          |                                  |               |
casmin2a               U  | .46341   .32852     27.8         |   2.56  0.010 |     .
                       M  | .46341       .5     -7.5    72.9 |  -0.47  0.642 |     .
                          |                                  |               |
casmin2bc              U  | .09756   .10992     -4.0         |  -0.35  0.724 |     .
                       M  | .09756        0     31.9  -689.1 |   2.96  0.004 |     .
                          |                                  |               |
casmin3ab              U  | .19512   .23964    -10.8         |  -0.93  0.351 |     .
                       M  | .19512    .2439    -11.8    -9.6 |  -0.75  0.454 |     .
                          |                                  |               |
expft                  U  | 12.722   15.261    -27.6         |  -2.51  0.012 |  1.08
                       M  | 12.722   13.966    -13.5    51.0 |  -0.87  0.383 |  1.13
                          |                                  |               |
expue01                U  | .87561   .32648     49.2         |   5.30  0.000 |  1.97*
                       M  | .87561   .59146     25.5    48.3 |   1.44  0.153 |  1.06
                          |                                  |               |
firm20_199             U  | .43902   .26947     35.9         |   3.40  0.001 |     .
                       M  | .43902   .43902      0.0   100.0 |   0.00  1.000 |     .
                          |                                  |               |
firm200_1999           U  | .10976   .23398    -33.3         |  -2.64  0.008 |     .
                       M  | .10976   .06098     13.1    60.7 |   1.12  0.266 |     .
                          |                                  |               |
firm1999over           U  | .07317    .2255    -43.7         |  -3.28  0.001 |     .
                       M  | .07317   .06098      3.5    92.0 |   0.31  0.757 |     .
                          |                                  |               |
publicservice          U  | .10976   .26759    -41.1         |  -3.21  0.001 |     .
                       M  | .10976   .09756      3.2    92.3 |   0.25  0.799 |     .
                          |                                  |               |
----------------------------------------------------------------------------------------
* if variance ratio outside [0.64; 1.55] for U and [0.64; 1.55] for M

-----------------------------------------------------------------------------------
 Sample    | Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B      R     %Var
-----------+-----------------------------------------------------------------------
 Unmatched | 0.087     66.90    0.000     26.5      28.2      97.7*   0.75     33
 Matched   | 0.029      6.31    0.934     10.7       9.7      40.6*   1.18      0
-----------------------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]

. 
. *******************************************
. * Ex 1.3) other outcomes
. *******************************************
. psmatch2 D $X, outcome(Y03) logit common neighbor(10) quietly
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
             Y03  Unmatched |  2.2346316   2.58840511  -.353773517    .05156966    -6.86
                        ATT |  2.2346316    2.4687611  -.234129499   .047137828    -4.97
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |     3,184 |     3,184 
   Treated |        82 |        82 
-----------+-----------+----------
     Total |     3,266 |     3,266 


. psmatch2 D $X, outcome(Y04) logit common neighbor(10) quietly
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
             Y04  Unmatched | 2.20218684   2.60309647  -.400909637   .047092271    -8.51
                        ATT | 2.19934331   2.40999182   -.21064851   .042414911    -4.97
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0      2,894 |     2,894 
   Treated |         1        104 |       105 
-----------+----------------------+----------
     Total |         1      2,998 |     2,999 


. psmatch2 D $X, outcome(Y05) logit common neighbor(10) quietly
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
             Y05  Unmatched | 2.20098797   2.60067714  -.399689165   .047438882    -8.43
                        ATT | 2.20098797   2.42296547  -.221977501   .060368522    -3.68
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |     2,668 |     2,668 
   Treated |       103 |       103 
-----------+-----------+----------
     Total |     2,771 |     2,771 


. 
. 
. 
. ****************************** Causal analysis using longitudinal data: Difference-in-difference propensity score matching *********************
> *************
. 
. **************************************************************
. * Ex 2.1) Diff-in-Diff
. **************************************************************
. gen Ydiff0301=Y03-Y01
(440 missing values generated)

. 
. sum Ydiff0301 Y03 Y01 if D==0 & Y03~=. & Y01~=.

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
   Ydiff0301 |      3129    .0526926    .3080097  -2.146036   2.621752
         Y03 |      3129    2.589036    .4594659   .0368344   4.507399
         Y01 |      3129    2.536344    .4568507  -.3238973   5.020867

. sum Ydiff0301 Y03 Y01 if D==1 & Y03~=. & Y01~=.

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
   Ydiff0301 |        82     .012518    .3800364  -1.116153   1.115419
         Y03 |        82    2.234632    .3779875   .8728443   2.912143
         Y01 |        82    2.222114    .4030407   .8875285   2.970992

. 
. **************************************************************
. * Ex 2.2) NN(10) matching with replacement combined with Diff-in-Diff
. **************************************************************
. psmatch2 D $X, outcome(Ydiff0301) common neighbor(10) quietly
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
       Ydiff0301  Unmatched | .012517999   .052692553  -.040174554   .034683212    -1.16
                        ATT | .012517999   .047426012  -.034908013   .044412763    -0.79
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |     3,129 |     3,129 
   Treated |        82 |        82 
-----------+-----------+----------
     Total |     3,211 |     3,211 


. 
. *** alternative
. psmatch2 D $X, outcome(Y03 Y01) common neighbor(10)

Probit regression                                 Number of obs   =       3211
                                                  LR chi2(14)     =      66.60
                                                  Prob > chi2     =     0.0000
Log likelihood = -348.38842                       Pseudo R2       =     0.0872

-------------------------------------------------------------------------------
            D |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
          age |  -.0170113   .0107178    -1.59   0.112    -.0380178    .0039952
       female |   .0460385   .1109509     0.41   0.678    -.1714213    .2634984
         east |    .135405   .1164781     1.16   0.245    -.0928878    .3636978
    nongerman |  -.2933911   .2343223    -1.25   0.211    -.7526544    .1658721
     casmin1c |  -.1250829   .2349413    -0.53   0.594    -.5855595    .3353936
     casmin2a |   .1034209   .2298182     0.45   0.653    -.3470145    .5538563
    casmin2bc |  -.0714307   .2645836    -0.27   0.787     -.590005    .4471437
    casmin3ab |  -.0222562     .24468    -0.09   0.928    -.5018203    .4573078
        expft |   .0000677    .010035     0.01   0.995    -.0196006     .019736
      expue01 |   .1528212   .0362029     4.22   0.000     .0818648    .2237775
   firm20_199 |   .1209143   .1163374     1.04   0.299    -.1071028    .3489314
 firm200_1999 |  -.3521473    .160371    -2.20   0.028    -.6664686    -.037826
 firm1999over |  -.4634934   .1795845    -2.58   0.010    -.8154727   -.1115142
publicservice |  -.3340887   .1484688    -2.25   0.024    -.6250822   -.0430952
        _cons |  -1.258417   .3882554    -3.24   0.001    -2.019383   -.4974501
-------------------------------------------------------------------------------
There are observations with identical propensity score values.
The sort order of the data could affect your results.
Make sure that the sort order is random before calling psmatch2.
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
             Y03  Unmatched |  2.2346316   2.58903637  -.354404773   .051189968    -6.92
                        ATT |  2.2346316   2.40829794  -.173666342   .046340182    -3.75
----------------------------+-----------------------------------------------------------
             Y01  Unmatched |  2.2221136   2.53634382  -.314230218   .050964313    -6.17
                        ATT |  2.2221136   2.36087193  -.138758329   .049121504    -2.82
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |     3,129 |     3,129 
   Treated |        82 |        82 
-----------+-----------+----------
     Total |     3,211 |     3,211 


. 
. 
. log close
      name:  <unnamed>
       log:  A:\Lehre\2015_WS_Workshop Kausalanalyse Kassel\Uebung_Matching\matching_DID.log
  log type:  text
 closed on:  28 Oct 2015, 16:10:08
--------------------------------------------------------------------------------------------------------------------------------------------------
